app/Controllers/BaseController.php

    protected function loadUser()
    {
        $userId = $this->session->get('user');
        if ($userId) {
            $this->currentUser = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'