app/Controllers/ImageController.php

    public function showGallery($id = null, $isGalleryRoute)
    {
        $this->isAuthenticated();

        // Obtiene todas las imágenes de la base de datos
        $images = $this->imageModel->getImagesByOwner($id);
        $userModel = new UserModel();
        $user = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'