app/Controllers/RegisterController.php

INSERT INTO `users` (`name`, `email`, `pass`, `admin`) VALUES ('Leobardo', 'slinas@gmail.com', '$2y$10$uSzmgQgSZRudzQfpsLv7seqgT1iEtDYUsH8a7G3XKgsiUlQmiKVye', 0)
---
    public function register(){

        if ($this->request->getMethod() === 'POST' && $this->validate([
            'name' => 'required',
            'email' => 'required|valid_email',  // Se asegura de que sea un email válido
            'pass'  => 'required',
        ])) {
            $model = new UserModel();
            $user = $model->insert([
                'name' => $this->request->getPost('name'),
                'email' => $this->request->getPost('email'),
                'pass' => password_hash($this->request->getPost('pass'), PASSWORD_DEFAULT),
                'admin' => false
            ]);