app/Models/ImageModel.php

SELECT *
FROM `Images`
WHERE `id_user` = '1'
---
    public function getImagesByOwner($propietarioId)
    {
        $query = $this->where('id_user', $propietarioId);

        return $query->findAll();