app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `users`.`id` = '7'
---
    public function getUser($id = null)
    {
        return $id ? $this->find($id) : $this->findAll();